; domain
(define (domain rover)
(:requirements :typing)
(:types 	rover waypoint store camera mode lander objective - object
)

(:predicates (at ?x - rover ?y - waypoint)
	(at_lander ?x - lander ?y - waypoint)
	(can_traverse ?r - rover ?x - waypoint ?y - waypoint)
	(equipped_for_soil_analysis ?r - rover)
	(equipped_for_rock_analysis ?r - rover)
	(equipped_for_imaging ?r - rover)
	(empty ?s - store)
	(have_rock_analysis ?r - rover ?w - waypoint)
	(have_soil_analysis ?r - rover ?w - waypoint)
	(full ?s - store)
	(calibrated ?c - camera ?r - rover)
	(supports ?c - camera ?m - mode)
	(available ?r - rover)
	(visible ?w - waypoint ?p - waypoint)
	(have_image ?r - rover ?o - objective ?m - mode)
	(communicated_soil_data ?w - waypoint)
	(communicated_rock_data ?w - waypoint)
	(communicated_image_data ?o - objective ?m - mode)
	(at_soil_sample ?w - waypoint)
	(at_rock_sample ?w - waypoint)
	(visible_from ?o - objective ?w - waypoint)
	(store_of ?s - store ?r - rover)
	(calibration_target ?i - camera ?o - objective)
	(on_board ?i - camera ?r - rover)
	(channel_free ?l - lander)
)

(:action navigate
	:parameters   (?x - rover ?y - waypoint ?z - waypoint)
	:precondition (and (visible ?y ?z) (can_traverse ?x ?y ?z) (available ?x) (at ?x ?y))
	:effect       (and (at ?x ?z) (not (at ?x ?y))
))

(:action sample_soil
	:parameters   (?x - rover ?s - store ?p - waypoint)
	:precondition (and (store_of ?s ?x) (equipped_for_soil_analysis ?x) (at ?x ?p) (empty ?s) (at_soil_sample ?p))
	:effect       (and (have_soil_analysis ?x ?p) (full ?s) (not (empty ?s)) (not (at_soil_sample ?p))
))

(:action sample_rock
	:parameters   (?x - rover ?s - store ?p - waypoint)
	:precondition (and (store_of ?s ?x) (at ?x ?p) (empty ?s) (equipped_for_rock_analysis ?x) (at_rock_sample ?p))
	:effect       (and (have_rock_analysis ?x ?p) (full ?s) (not (empty ?s)) (not (at_rock_sample ?p))
))

(:action drop
	:parameters   (?x - rover ?y - store)
	:precondition (and (store_of ?y ?x) (full ?y))
	:effect       (and (empty ?y) (not (full ?y))
))

(:action calibrate
	:parameters   (?r - rover ?i - camera ?t - objective ?w - waypoint)
	:precondition (and (calibration_target ?i ?t) (visible_from ?t ?w) (on_board ?i ?r) (equipped_for_imaging ?r) (at ?r ?w))
	:effect       (and (calibrated ?i ?r)
))

(:action take_image
	:parameters   (?r - rover ?p - waypoint ?o - objective ?i - camera ?m - mode)
	:precondition (and (at ?r ?p) (supports ?i ?m) (on_board ?i ?r) (equipped_for_imaging ?r) (calibrated ?i ?r) (visible_from ?o ?p))
	:effect       (and (have_image ?r ?o ?m) (not (calibrated ?i ?r))
))

(:action communicate_soil_data
	:parameters   (?r - rover ?l - lander ?p - waypoint ?x - waypoint ?y - waypoint)
	:precondition (and (available ?r) (have_soil_analysis ?r ?p) (channel_free ?l) (visible ?x ?y) (at ?r ?x) (at_lander ?l ?y))
	:effect       (and (communicated_soil_data ?p)
))

(:action communicate_rock_data
	:parameters   (?r - rover ?l - lander ?p - waypoint ?x - waypoint ?y - waypoint)
	:precondition (and (available ?r) (channel_free ?l) (visible ?x ?y) (have_rock_analysis ?r ?p) (at ?r ?x) (at_lander ?l ?y))
	:effect       (and (communicated_rock_data ?p)
))

(:action communicate_image_data
	:parameters   (?r - rover ?l - lander ?o - objective ?m - mode ?x - waypoint ?y - waypoint)
	:precondition (and (available ?r) (have_image ?r ?o ?m) (channel_free ?l) (visible ?x ?y) (at ?r ?x) (at_lander ?l ?y))
	:effect       (and (communicated_image_data ?o ?m)
))
)

; problem
(define (problem roverprob1796) (:domain Rover)
(:objects
	general - Lander
	colour high_res low_res - Mode
	rover0 - Rover
	rover0store - Store
	waypoint0 waypoint1 waypoint2 waypoint3 - Waypoint
	camera0 camera1 - Camera
	objective0 objective1 objective2 objective3 objective4 objective5 objective6 - Objective
	)
(:init
	(visible waypoint0 waypoint1)
	(visible waypoint1 waypoint0)
	(visible waypoint0 waypoint2)
	(visible waypoint2 waypoint0)
	(visible waypoint0 waypoint3)
	(visible waypoint3 waypoint0)
	(visible waypoint2 waypoint1)
	(visible waypoint1 waypoint2)
	(visible waypoint2 waypoint3)
	(visible waypoint3 waypoint2)
	(at_soil_sample waypoint0)
	(at_rock_sample waypoint0)
	(at_soil_sample waypoint1)
	(at_rock_sample waypoint1)
	(at_rock_sample waypoint3)
	(at_lander general waypoint3)
	(channel_free general)
	(at rover0 waypoint2)
	(available rover0)
	(store_of rover0store rover0)
	(empty rover0store)
	(equipped_for_soil_analysis rover0)
	(equipped_for_imaging rover0)
	(can_traverse rover0 waypoint2 waypoint0)
	(can_traverse rover0 waypoint0 waypoint2)
	(can_traverse rover0 waypoint2 waypoint1)
	(can_traverse rover0 waypoint1 waypoint2)
	(can_traverse rover0 waypoint0 waypoint3)
	(can_traverse rover0 waypoint3 waypoint0)
	(on_board camera0 rover0)
	(calibration_target camera0 objective4)
	(supports camera0 colour)
	(supports camera0 high_res)
	(on_board camera1 rover0)
	(calibration_target camera1 objective6)
	(supports camera1 high_res)
	(supports camera1 low_res)
	(visible_from objective0 waypoint0)
	(visible_from objective1 waypoint0)
	(visible_from objective1 waypoint1)
	(visible_from objective1 waypoint2)
	(visible_from objective2 waypoint1)
	(visible_from objective2 waypoint2)
	(visible_from objective3 waypoint0)
	(visible_from objective3 waypoint2)
	(visible_from objective3 waypoint3)
	(visible_from objective4 waypoint1)
	(visible_from objective4 waypoint3)
	(visible_from objective5 waypoint0)
	(visible_from objective5 waypoint2)
	(visible_from objective5 waypoint3)
	(visible_from objective6 waypoint0)
	(visible_from objective6 waypoint1)
	(visible_from objective6 waypoint3)
)

(:goal (and
(communicated_soil_data waypoint0)
(communicated_soil_data waypoint1)
(communicated_image_data objective6 high_res)
(communicated_image_data objective3 high_res)
(communicated_image_data objective1 high_res)
(communicated_image_data objective5 colour)
	)
)
)

; plan
1. (navigate rover0 waypoint2 waypoint1)
   deleted: (at rover0 waypoint2)
   added: (at rover0 waypoint1)
   goals met: 0 of 6
2. (sample_soil rover0 rover0store waypoint1)
   deleted: (empty rover0store) (at_soil_sample waypoint1)
   added: (have_soil_analysis rover0 waypoint1) (full rover0store)
   goals met: 0 of 6
3. (calibrate rover0 camera1 objective6 waypoint1)
   added: (calibrated camera1 rover0)
   goals met: 0 of 6
4. (calibrate rover0 camera0 objective4 waypoint1)
   added: (calibrated camera0 rover0)
   goals met: 0 of 6
5. (navigate rover0 waypoint1 waypoint2)
   deleted: (at rover0 waypoint1)
   added: (at rover0 waypoint2)
   goals met: 0 of 6
6. (take_image rover0 waypoint2 objective5 camera0 colour)
   deleted: (calibrated camera0 rover0)
   added: (have_image rover0 objective5 colour)
   goals met: 0 of 6
7. (take_image rover0 waypoint2 objective1 camera1 high_res)
   deleted: (calibrated camera1 rover0)
   added: (have_image rover0 objective1 high_res)
   goals met: 0 of 6
8. (navigate rover0 waypoint2 waypoint0)
   deleted: (at rover0 waypoint2)
   added: (at rover0 waypoint0)
   goals met: 0 of 6
9. (communicate_image_data rover0 general objective5 colour waypoint0 waypoint3)
   added: (communicated_image_data objective5 colour)
   goals met: 1 of 6
10. (communicate_image_data rover0 general objective1 high_res waypoint0 waypoint3)
   added: (communicated_image_data objective1 high_res)
   goals met: 2 of 6
11. (calibrate rover0 camera1 objective6 waypoint0)
   added: (calibrated camera1 rover0)
   goals met: 2 of 6
12. (communicate_soil_data rover0 general waypoint1 waypoint0 waypoint3)
   added: (communicated_soil_data waypoint1)
   goals met: 3 of 6
13. (drop rover0 rover0store)
   deleted: (full rover0store)
   added: (empty rover0store)
   goals met: 3 of 6
14. (sample_soil rover0 rover0store waypoint0)
   deleted: (empty rover0store) (at_soil_sample waypoint0)
   added: (have_soil_analysis rover0 waypoint0) (full rover0store)
   goals met: 3 of 6
15. (communicate_soil_data rover0 general waypoint0 waypoint0 waypoint3)
   added: (communicated_soil_data waypoint0)
   goals met: 4 of 6
16. (take_image rover0 waypoint0 objective3 camera1 high_res)
   deleted: (calibrated camera1 rover0)
   added: (have_image rover0 objective3 high_res)
   goals met: 4 of 6
17. (calibrate rover0 camera1 objective6 waypoint0)
   added: (calibrated camera1 rover0)
   goals met: 4 of 6
18. (communicate_image_data rover0 general objective3 high_res waypoint0 waypoint3)
   added: (communicated_image_data objective3 high_res)
   goals met: 5 of 6
19. (take_image rover0 waypoint0 objective6 camera1 high_res)
   deleted: (calibrated camera1 rover0)
   added: (have_image rover0 objective6 high_res)
   goals met: 5 of 6
20. (communicate_image_data rover0 general objective6 high_res waypoint0 waypoint3)
   added: (communicated_image_data objective6 high_res)
   goals met: 6 of 6
